In [1]:
import requests
import json
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:

def get_exchange_rates(year, month, day, base_currency='USD', api_key='f56667b23b9b85f2fafce581',amount=1):
    url = f"https://v6.exchangerate-api.com/v6/{api_key}/history/{base_currency}/{year}/{month}/{day}"
        
    response = requests.get(url)
    data = response.json()  
    
    exchange_rates = data['conversion_rates']
    return  exchange_rates.get("ILS")

In [3]:
api_key = 'f56667b23b9b85f2fafce581'

# Specify the date for which you want historical exchange rates
year = int(2023)
month = int(12)
day = int(12)

base_currency = 'USD'

# Optionally, specify the amount to convert
amount = float(200)

# Call the function to fetch historical exchange rates
get_exchange_rates(year, month, day, base_currency, api_key, amount)

3.71240358

In [4]:
# postgresql://host:password@username:port/database')
engine = create_engine('postgresql://postgres:post1234@127.0.0.1:5432/chinook?options=-csearch_path=stg')

# Test the connection
try:
    connection = engine.connect()
    print("Connected successfully")
except Exception as e:
    print("Connection failed:", e)

Connected successfully

In [5]:
query = "SELECT * FROM fact_invoice"
fact_invoice = pd.read_sql_query(query, engine)

In [6]:
ilsRates = pd.DataFrame(columns=['dates', 'ils_rate'])

In [7]:
# unique dates from fact_invoice
all_unique_dates = fact_invoice['invoicedate'].dt.date.unique()

ilsRates['dates'] = np.unique(all_unique_dates)

In [8]:
exchange_rates = []

for d in ilsRates['dates']:
    rate = get_exchange_rates(d.year, d.month, d.day, base_currency, api_key, amount)
    exchange_rates.append(rate)

ilsRates['ils_rate'] = exchange_rates

## Transforming fact_invoice

In [9]:
ilsRates['dates'] = pd.to_datetime(ilsRates['dates'], format='%Y-%m-%d')
ilsRates['dates'] = ilsRates['dates'].dt.date

In [10]:
fact_invoice['invoicedate'] = fact_invoice['invoicedate'].dt.date

In [11]:
fact_invoice

,invoiceid,customerid,invoicedate,total,last_update,dbt_time
0,1,2,2018-01-01,1.98,2023-01-04 12:05:40.330691,24-03-07 15:09:28
1,2,4,2018-01-02,3.96,2023-01-04 12:05:40.332702,24-03-07 15:09:28
2,3,8,2018-01-03,5.94,2023-01-04 12:05:40.334024,24-03-07 15:09:28
3,4,14,2018-01-06,8.91,2023-01-04 12:05:40.335723,24-03-07 15:09:28
4,5,23,2018-01-11,13.86,2023-01-04 12:05:40.336992,24-03-07 15:09:28
...,...,...,...,...,...,...
3806,3807,69,2021-09-24,3.96,2023-01-04 12:05:45.787036,24-03-07 15:09:28
3807,3808,70,2021-03-12,2.97,2023-01-04 12:05:45.788045,24-03-07 15:09:28
3808,3809,71,2019-10-20,2.97,2023-01-04 12:05:45.789074,24-03-07 15:09:28
3809,3810,72,2021-12-14,1.98,2023-01-04 12:05:45.790124,24-03-07 15:09:28
3810,3811,73,2022-03-23,4.95,2023-01-04 12:05:45.791555,24-03-07 15:09:28

In [12]:
type(fact_invoice['invoicedate'][0])

datetime.date

In [13]:
fact_invoice_ils = pd.merge(fact_invoice, ilsRates, left_on=['invoicedate'], right_on=['dates'])

In [14]:
fact_invoice_ils['ils_rate'] = fact_invoice_ils['ils_rate'].apply(lambda x: round(x,2))
fact_invoice_ils['ils_total'] = (fact_invoice_ils['total'] * fact_invoice_ils['ils_rate']).apply(lambda x: round(x,2))

In [15]:
fact_invoice_ils

,invoiceid,customerid,invoicedate,total,last_update,dbt_time,dates,ils_rate,ils_total
0,1,2,2018-01-01,1.98,2023-01-04 12:05:40.330691,24-03-07 15:09:28,2018-01-01,3.47,6.87
1,2717,225,2018-01-01,1.98,2023-01-04 12:05:44.385080,24-03-07 15:09:28,2018-01-01,3.47,6.87
2,3164,195,2018-01-01,2.97,2023-01-04 12:05:44.974759,24-03-07 15:09:28,2018-01-01,3.47,10.31
3,2,4,2018-01-02,3.96,2023-01-04 12:05:40.332702,24-03-07 15:09:28,2018-01-02,3.47,13.74
4,3,8,2018-01-03,5.94,2023-01-04 12:05:40.334024,24-03-07 15:09:28,2018-01-03,3.45,20.49
...,...,...,...,...,...,...,...,...,...
3806,3771,75,2020-05-16,0.99,2023-01-04 12:05:45.740799,24-03-07 15:09:28,2020-05-16,3.54,3.50
3807,3773,77,2018-04-03,8.93,2023-01-04 12:05:45.742945,24-03-07 15:09:28,2018-04-03,3.52,31.43
3808,3794,77,2019-11-27,1.98,2023-01-04 12:05:45.770705,24-03-07 15:09:28,2019-11-27,3.47,6.87
3809,3808,70,2021-03-12,2.97,2023-01-04 12:05:45.788045,24-03-07 15:09:28,2021-03-12,3.32,9.86
3810,3809,71,2019-10-20,2.97,2023-01-04 12:05:45.789074,24-03-07 15:09:28,2019-10-20,3.54,10.51

## Uploading to Postgresql

In [16]:
fact_invoice_ils = fact_invoice_ils.drop(['dates'],axis=1)

In [17]:
schema_name = 'stg'

# Write the DataFrame to the database table
fact_invoice_ils.to_sql('fact_invoice', con=engine, schema=schema_name, if_exists='replace', index=False)
ilsRates.to_sql('dim_currency', con=engine, schema=schema_name, if_exists='replace', index=False)

592

In [18]:
ilsRates

           dates  ils_rate
0     2018-01-01  3.468800
1     2018-01-02  3.465200
2     2018-01-03  3.454100
3     2018-01-04  3.448400
4     2018-01-05  3.438200
...          ...       ...
1587  2022-12-18  3.457624
1588  2022-12-19  3.455103
1589  2022-12-20  3.459492
1590  2022-12-21  3.469157
1591  2022-12-22  3.473684

[1592 rows x 2 columns]